BojanJurca/Esp32_oscilloscope/httpServer.hpp
        WEBSOCKET_DATA_TYPE available ()  { // checks if data is ready to be read, returns the type of data that has arrived.
                                            // All the TCP connection reading is actually done within this function
                                            // that buffers the data that can later be read by using readString () or
                                            // readBinary () or binarySize () functions. Call it repeatedly until
                                            // some other data type is returned.

          switch (__readFrameState__) {
            case EMPTY:                   {
                                            // prepare data structure for the first read operation
                                            __bytesRead__ = 0;
                                            __readFrameState__ = READING_SHORT_HEADER;
                                            // continue reading immediately
                                          }
            case READING_SHORT_HEADER:    { 
                                            // check socket if data is pending to be read
                                            char c; int i = recv (__connectionSocket__, &c, sizeof (c), MSG_PEEK);
                                            if (i == -1) {
                                              if ((errno == EAGAIN || errno == ENAVAIL) && (millis () - __lastActive__ < HTTP_CONNECTION_WS_TIME_OUT || !HTTP_CONNECTION_WS_TIME_OUT)) {
                                                return WebSocket::NOT_AVAILABLE; // not time-out yet
                                              } else {
                                                closeWebSocket ();
                                                return WebSocket::TIME_OUT;
                                              }
                                            }
                                            // else - something is available to be read

                                            // read 6 bytes of short header
                                            i = recv (__connectionSocket__, __readFrame__ + __bytesRead__, 6 - __bytesRead__, 0); 
                                            if (i <= 0) {
                                              closeWebSocket ();
                                              return WebSocket::ERROR;
                                            }

                                            networkTrafficInformation.bytesReceived += i; // update performance counter without semaphore - values may not be perfectly exact but we won't loose time this way
                                            socketTrafficInformation [__connectionSocket__ - LWIP_SOCKET_OFFSET].bytesReceived += i; // update performance counter without semaphore - values may not be perfectly exact but we won't loose time this way
                                            socketTrafficInformation [__connectionSocket__ - LWIP_SOCKET_OFFSET].lastActiveMillis = millis ();
                                                                                           
                                            __lastActive__ = millis ();
                                            if (6 != (__bytesRead__ += i)) return WebSocket::NOT_AVAILABLE; // if we haven't got 6 bytes continue reading short header the next time available () is called
                                            // check if this frame type is supported
                                            if (!(__readFrame__ [0] & 0b10000000)) { // check fin bit
                                              dmesg ("[WebSocket] frame type not supported");
                                              closeWebSocket ();
                                              return WebSocket::ERROR;
                                            }
                                            byte b  = __readFrame__ [0] & 0b00001111; // check opcode, 1 = text, 2 = binary, 8 = close
                                            if (b == WebSocket::CLOSE) {
                                              // dmesg ("[WebSocket] closed by peer");
                                              closeWebSocket ();
                                              return WebSocket::CLOSE;
                                            }
                                            if (b != WebSocket::STRING && b != WebSocket::BINARY) { 
                                              dmesg ("[WebSocket] only STRING and BINARY frame types are supported");
                                              closeWebSocket ();
                                              return WebSocket::ERROR;
                                            } // NOTE: after this point only TEXT and BINRY frames are processed!
                                            // check payload length that also determines frame type
                                            __readBufferSize__ = __readFrame__ [1] & 0b01111111; // byte 1: mask bit is always 1 for packets that come from browsers, cut it off
                                            if (__readBufferSize__ <= 125) { // short payload
                                                  __mask__ = __readFrame__ + 2; // bytes 2, 3, 4, 5
                                                  __readBuffer__  = __readFrame__ + 6; // skip 6 bytes of header, note that __readFrame__ is large enough
                                                  // continue with reading payload immediatelly
                                                  __readFrameState__ = READING_PAYLOAD;
                                                  __bytesRead__ = 0; // reset the counter, count only payload from now on
                                                  goto readingPayload;
                                            } else if (__readBufferSize__ == 126) { // 126 means medium payload, read additional 2 bytes of header
                                                  __readFrameState__ = READING_MEDIUM_HEADER;
                                                  // continue reading immediately
                                            } else { // 127 means large data block - not supported since ESP32 doesn't have enough memory
                                                  closeWebSocket ();
                                                  return WebSocket::ERROR;                         
                                            }
                                          }
            case READING_MEDIUM_HEADER:   { 
                                            // we don't have to repeat the checking already done in short header case, just read additiona 2 bytes and update the data structure
                                            // read additional 2 bytes (8 altogether) bytes of medium header
                                            int i = recv (__connectionSocket__, __readFrame__ + __bytesRead__, 8 - __bytesRead__, 0); 
                                            if (i <= 0) {
                                              closeWebSocket ();
                                              return WebSocket::ERROR;
                                            }

                                            networkTrafficInformation.bytesReceived += i; // update performance counter without semaphore - values may not be perfectly exact but we won't loose time this way
                                            socketTrafficInformation [__connectionSocket__ - LWIP_SOCKET_OFFSET].bytesReceived += i; // update performance counter without semaphore - values may not be perfectly exact but we won't loose time this way
                                            socketTrafficInformation [__connectionSocket__ - LWIP_SOCKET_OFFSET].lastActiveMillis = millis ();

                                            __lastActive__ = millis ();
                                            if (8 != (__bytesRead__ += i)) return WebSocket::NOT_AVAILABLE; // if we haven't got 8 bytes continue reading medium header the next time available () is called
                                            // correct internal structure for reading into extended buffer and continue at FILLING_EXTENDED_BUFFER immediately
                                            __readBufferSize__ = __readFrame__ [2] << 8 | __readFrame__ [3];
                                            __mask__ = __readFrame__ + 4; // bytes 4, 5, 6, 7
                                            __readBuffer__  = __readFrame__ + 8; // skip 8 bytes of header, check if __readFrame is large enough:
                                            if (__readBufferSize__ > HTTP_WS_FRAME_MAX_SIZE - 8) {
                                              dmesg ("[WebSocket] can only receive frames of up to ", HTTP_WS_FRAME_MAX_SIZE - 8, (char *) " payload bytes");
                                              closeWebSocket ();
                                              return WebSocket::ERROR;
                                            }
                                            __readFrameState__ = READING_PAYLOAD;
                                            __bytesRead__ = 0; // reset the counter, count only payload from now on
                                            // continue with reading payload immediatelly
                                          }
            case READING_PAYLOAD:         
        readingPayload:                                                    
                                          {
                                            // read all payload bytes
                                            int i = recv (__connectionSocket__, __readBuffer__ + __bytesRead__, __readBufferSize__ - __bytesRead__, 0); 
                                            if (i <= 0) {
                                              closeWebSocket ();
                                              __readFrameState__ = EMPTY;
                                              return WebSocket::ERROR;
                                            }

                                            networkTrafficInformation.bytesReceived += i; // update performance counter without semaphore - values may not be perfectly exact but we won't loose time this way
                                            socketTrafficInformation [__connectionSocket__ - LWIP_SOCKET_OFFSET].bytesReceived += i; // update performance counter without semaphore - values may not be perfectly exact but we won't loose time this way
                                            socketTrafficInformation [__connectionSocket__ - LWIP_SOCKET_OFFSET].lastActiveMillis = millis ();
                                        
                                            if (__readBufferSize__ != (__bytesRead__ += i)) return WebSocket::NOT_AVAILABLE; // if we haven't got all payload bytes continue reading the next time available () is called
                                            __lastActive__ = millis ();
                                            // all is read, decode (unmask) the data
                                            for (int i = 0; i < __readBufferSize__; i++) __readBuffer__ [i] = (__readBuffer__ [i] ^ __mask__ [i % 4]);
                                            // conclude payload with 0 in case this is going to be interpreted as text - like C string
                                            __readBuffer__ [__readBufferSize__] = 0;
                                            __readFrameState__ = FULL;     // stop reading until buffer is read by the calling program
                                            return __readFrame__ [0] & 0b0000001 /* if text bit set */ ? STRING : BINARY; // notify calling program about the type of data waiting to be read, 1 = text, 2 = binary
                                          }

            case FULL:                    // return immediately, there is no space left to read additional incoming data
                                          return __readFrame__ [0] & 0b0000001 /* if text bit set */ ? STRING : BINARY; // notify calling program about the type of data waiting to be read, 1 = text, 2 = binary 
          }
          // for every case that has not been handeled earlier return not available
          return NOT_AVAILABLE;
        }

