BojanJurca/Esp32_oscilloscope/httpServer.hpp
        endOfConnection:  
          // all variables are freed now, unload the instance and stop the task (in this order)
          delete ths;
          vTaskDelete (NULL); // it is connection's responsibility to close itself
        }

    };


    // ----- httpServer class -----

    class httpServer {                                             
    
      public:

        // httpServer state
        enum STATE_TYPE {
          NOT_RUNNING = 0, 
          STARTING = 1, 
          RUNNING = 2        
        };
        
        STATE_TYPE state () { return __state__; }
    
        httpServer ( // the following parameters will be pased to each httpConnection instance
                     String (*httpRequestHandlerCallback) (char *httpRequest, httpConnection *hcn), // httpRequestHandler callback function provided by calling program
                     void (*wsRequestHandler) (char *wsRequest, WebSocket *webSocket),              // httpRequestHandler callback function provided by calling program      
                     // the following parameters will be handeled by httpServer instance
                     char *serverIP,                                                                // HTTP server IP address, 0.0.0.0 for all available IP addresses
                     int serverPort,                                                                // HTTP server port
                     bool (*firewallCallback) (char *connectingIP),                                 // a reference to callback function that will be celled when new connection arrives 
                     char *httpServerHomeDirectory = (char *) "/var/www/html"
                   )  { 
                        // create directory structure
                        #ifdef __FILE_SYSTEM__
                          if (fileSystem.mounted ()) {
                            if (!fileSystem.isDirectory ((char *) "/var/www/html")) { fileSystem.makeDirectory ((char *) "/var"); fileSystem.makeDirectory ((char *) "/var/www"); fileSystem.makeDirectory ((char *) "/var/www/html"); }
                          }
                        #endif
                        // create a local copy of parameters for later use
                        __httpRequestHandlerCallback__ = httpRequestHandlerCallback;
                        __wsRequestHandler__ = wsRequestHandler;
                        strncpy (__serverIP__, serverIP, sizeof (__serverIP__)); __serverIP__ [sizeof (__serverIP__) - 1] = 0;
                        __serverPort__ = serverPort;
                        __firewallCallback__ = firewallCallback;
                        #ifdef __FILE_SYSTEM__
                            if (!httpServerHomeDirectory || !*httpServerHomeDirectory || strlen (httpServerHomeDirectory) >= sizeof (__httpServerHomeDirectory__) - 2) {
                                dmesg ("[httpServer] invalid httpServerHomeDirectory");
                                return;
                            }
                            strcpy (__httpServerHomeDirectory__, httpServerHomeDirectory);
                            if (__httpServerHomeDirectory__ [strlen (__httpServerHomeDirectory__) - 1] != '/') strcat (__httpServerHomeDirectory__, "/"); // __httpServerHomeDirectory__ always ends with /
                        #endif                        

                        // start listener in its own thread (task)
                        __state__ = STARTING;                        
                        #define tskNORMAL_PRIORITY 1
                        #ifdef HTTP_SERVER_CORE
                            BaseType_t taskCreated = xTaskCreatePinnedToCore (__listenerTask__, "httpServer", HTTP_SERVER_STACK_SIZE, this, tskNORMAL_PRIORITY, NULL, HTTP_SERVER_CORE);
                        #else
                            BaseType_t taskCreated = xTaskCreate (__listenerTask__, "httpServer", HTTP_SERVER_STACK_SIZE, this, tskNORMAL_PRIORITY, NULL);
                        #endif
                        if (pdPASS != taskCreated) {
                          dmesg ("[httpServer] xTaskCreate error");
                        } else {
                          // wait until listener starts accepting connections
                          while (__state__ == STARTING) delay (1); 
                          // when constructor returns __state__ could be eighter RUNNING (in case of success) or NOT_RUNNING (in case of error)
                        }
                      }
        
        ~httpServer ()  {
                          // close listening socket
                          int listeningSocket;
                          xSemaphoreTake (__httpServerSemaphore__, portMAX_DELAY);
                            listeningSocket = __listeningSocket__;
                            __listeningSocket__ = -1;
                          xSemaphoreGive (__httpServerSemaphore__);
                          if (listeningSocket > -1) close (listeningSocket);

                          // wait until listener finishes before unloading so that memory variables are still there while the listener is running
                          while (__state__ != NOT_RUNNING) delay (1);
                        }
 
      private:

        STATE_TYPE __state__ = NOT_RUNNING;

        String (* __httpRequestHandlerCallback__) (char *httpRequest, httpConnection *hcn) = NULL;
        void (* __wsRequestHandler__) (char *wsRequest, WebSocket *webSocket) = NULL;
        char __serverIP__ [46] = "0.0.0.0";
        int __serverPort__ = 80;
        bool (* __firewallCallback__) (char *connectingIP) = NULL;

        #ifdef __FILE_SYSTEM__
            char __httpServerHomeDirectory__ [FILE_PATH_MAX_LENGTH] = "/var/www/html";
        #else
            char *__httpServerHomeDirectory__; // not used
        #endif        

        int __listeningSocket__ = -1;

        static void __listenerTask__ (void *pvParameters) {
          {
            // get "this" pointer
            httpServer *ths = (httpServer *) pvParameters;  
    
