BojanJurca/Esp32_oscilloscope/httpServer.hpp
    };


    /*  
       Internal "database" od valid web session tokens  
    */

    class webSessionToken {  
      public:

        char *generateToken (httpConnection *hcn) { // calculates new token from random number and client specific information
          sha256 (__token__, sizeof (__token__), (char *) (String (__randomNumber__) + hcn->getClientSpecificInformation ()).c_str ());
          __lastActive__ = millis ();
          return getToken ();
        }

        bool isTokenValid (httpConnection *hcn) { // checks token validity against client specific information and time-out
          if (millis () - __lastActive__ >= WEB_SESSION_TIME_OUT) return false; // web session token time-out
          if (!*__token__) return false; // web  session token not set
          char token [65];
          sha256 (token, sizeof (token), (char *) (String (__randomNumber__) + hcn->getClientSpecificInformation ()).c_str ());
          if (strcmp (__token__, token)) return false;
          __lastActive__ = millis ();
          return true;
        }

        char *getToken () {
          if (millis () - __lastActive__ >= WEB_SESSION_TIME_OUT) return NULL; // web session token time-out
          if (!*__token__) return NULL; // web  session token not set
          return __token__; // valid web session token
        }

        void deleteToken () { *__token__ = 0; }        

        void setAdditionalInformation (char *additionalInformation) { 
          __lastActive__ = millis ();
          strncpy (__additionalInformation__, additionalInformation, sizeof (__additionalInformation__)); __additionalInformation__ [sizeof (__additionalInformation__) - 1] = 0;
        };

        char *getAdditionalInformation () { 
          __lastActive__ = millis ();
          return __additionalInformation__; 
        };

      private:

        unsigned long __lastActive__;
        char __token__ [65] = {};
        long __randomNumber__ = random (2147483647);

        // any additional information connected to token like user name, ...
        char __additionalInformation__ [WEB_SESSION_TOKENS_ADDITIONAL_INFORMATION_SIZE] = {};
    };  
    
    webSessionToken __webSessionTokens__ [MAX_WEB_SESSION_TOKENS];

    String generateWebSessionToken (httpConnection *hcn) {
      for (int i = 0; i < MAX_WEB_SESSION_TOKENS; i++) { // find free slot
        if (!__webSessionTokens__ [i].getToken ()) {
          return __webSessionTokens__ [i].generateToken (hcn); // success
        }
      }
      return ""; // failure
    }

    bool isWebSessionTokenValid  (String token, httpConnection *hcn) {
      for (int i = 0; i < MAX_WEB_SESSION_TOKENS; i++) { // find token
        if (__webSessionTokens__ [i].getToken () && !strcmp (__webSessionTokens__ [i].getToken (), (char *) token.c_str ())) {
          return __webSessionTokens__ [i].isTokenValid (hcn); // check validity
        }
      }
      return false; // failure
    }

    bool deleteWebSessionToken  (String token) {
      for (int i = 0; i < MAX_WEB_SESSION_TOKENS; i++) { // find token
        if (__webSessionTokens__ [i].getToken () && !strcmp (__webSessionTokens__ [i].getToken (), (char *) token.c_str ())) {
          __webSessionTokens__ [i].deleteToken (); 
          return true; // success
        }
      }
      return false; // failure
    }

    // any additional information connected to token like user name, ...
    bool setWebSessionTokenAdditionalInformation  (String token, String additionalInformation) {
      for (int i = 0; i < MAX_WEB_SESSION_TOKENS; i++) { // find token
        if (__webSessionTokens__ [i].getToken () && !strcmp (__webSessionTokens__ [i].getToken (), (char *) token.c_str ())) {
          __webSessionTokens__ [i].setAdditionalInformation ((char *) additionalInformation.c_str ());
          return true;
        }
      }
      return false; // failure
    }

    // any additional information connected to token like user name, ...
    String getWebSessionTokenAdditionalInformation  (String token) {
      for (int i = 0; i < MAX_WEB_SESSION_TOKENS; i++) { // find token
        if (__webSessionTokens__ [i].getToken () && !strcmp (__webSessionTokens__ [i].getToken (), (char *) token.c_str ())) {
          return __webSessionTokens__ [i].getAdditionalInformation (); 
        }
      }
      return ""; // failure
    }
    
#endif
